behaviorTest/src/test/resources/solXmlData/FCXA-RJ-101111-B_24.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov.gsa.eoffer.webservice.sws.common.SwsService">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:publishSolicitation>
         <swsSolXml><![CDATA[<?xml version="1.0" encoding="UTF-8"?><solicitation pdf_link="http://sws-dev.fas.gsa.gov/sws-search/viewSolDocument.do?method=view&amp;solNum=RkNYQS1SSi0xMDExMTEtQg==&amp;solRefresh=MjQ=&amp;solDoc=MDkwMWEwNzk4MDFlM2RiOQ==" refresh_number="24" solicitation_number="FCXA-RJ-101111-B" solicitation_type="SCHEDULES" vehicle_identifier="1011"><clauses><clause clause_number="552.211-78_Original_0_02_01_1996" template_name="sins">            <element isdivided="0" layout="label_top" name="CommercialDeliverySchedule" sequence="4">        <header/>        <title>Commercial Delivery Schedule</title>        <subtitle/>        <label>Will delivery be within 30 days after receipt of order (ARO)?</label>        <prefixlabel/>        <defaultvalue/>        <data isrequired="1" type="radio">            <option value="Yes">Yes</option>            <option value="No">No</option>        </data>        <datavalues>            <datavalue/>        </datavalues>        <fieldvalidation>            <validation>                <validationname>Required</validationname>                <validationvalue/>            </validation>        </fieldvalidation>    </element><element isdivided="0" layout="label_top" name="StateCommercialDeliveryTime" sequence="5">        <header/>        <title/>        <subtitle/>        <label>If no, within how many days?</label>        <prefixlabel/>        <defaultvalue/>        <data isrequired="0" maxlength="15" type="text_field"/>        <datavalues>            <datavalue/>        </datavalues>        <fieldvalidation/>    </element><element isdivided="1" layout="label_top" name="ExpeditedDeliveryTime" sequence="6">        <header/>        <title/>        <subtitle/>        <label>What is the expedited delivery time? (In Days)</label>        <prefixlabel/>        <defaultvalue/>        <data isrequired="0" maxlength="15" type="text_field"/>        <datavalues>            <datavalue/>        </datavalues>        <fieldvalidation/>    </element><validations><validation category="" id="1">			<applyon>StateCommercialDeliveryTime</applyon>			<dependon>CommercialDeliverySchedule</dependon>			<dependonvalue>No</dependonvalue>			<applyonvalidation>Required</applyonvalidation>		</validation><validation category="" id="2">			<applyon>StateCommercialDeliveryTime</applyon>			<dependon>CommercialDeliverySchedule</dependon>			<dependonvalue>Yes</dependonvalue>			<applyonvalidation>NotRequired</applyonvalidation>		</validation></validations></clause><clause clause_number="F-FSS-202-F_Original_0_07_13_2010" template_name="basic">
    
    
<element isdivided="1" layout="label_top" name="OverseasCoverageGeographicArea" sequence="0">
        <header/>
        <title>Delivery Prices (F-FSS-202-F)</title>
        <subtitle/>
        <label>If offerors are providing overseas coverage then provide the geographic area(s)/countries/zones below (Please enter N/A if not applicable).</label>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" maxlength="250" type="text_area"/>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element><validations/></clause><clause clause_number="G-FSS-900-C_Original_07_01_2003" template_name="">
    <template>
        <templateName group="contact">
            <name>Contact for Contract Administration (Domestic)</name>
            <type>domesticcontact</type>
        </templateName>
        <templateName group="contact">
            <name>Contact for Contract Administration (Overseas)</name>
            <type>overseascontact</type>
        </templateName>
        <templateName group="contact">
            <name>Industrial Funding Fee</name>
            <type>IndustrialFundingFee</type>
        </templateName>
        <templateName group="contact">
            <name>Contact for Marketing</name>
            <type>ContactforMarketing</type>
        </templateName>
    </template>
</clause><clause clause_number="552.238-78_Alternate_1_02_01_2007" template_name="basic">
    
<element isdivided="1" layout="label_top" name="Scope" sequence="19">
        <header/>
        <title>Scope of Contract (552.238-78 Alt I)</title>
        <subtitle/>
        <label>What is the Scope of this contract?</label>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" type="select">
            <option value="Contractor will provide domestic and overseas delivery">Contractor will provide domestic and overseas delivery</option>
            <option value="Contractor will provide overseas delivery only">Contractor will provide overseas delivery only</option>
            <option value="Contractor will provide domestic delivery only">Contractor will provide domestic delivery only</option>
        </data>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element></clause><clause clause_number="K-FSS-1_Original_0_06_29_2010" template_name="basic"/><clause clause_number="552.216-73_Alternate_1_09_01_1999" template_name="basic">
    
<element isdivided="1" layout="label_top" name="ParticipateInProposedContract" sequence="6">
        <header/>
        <title>Ordering Information (552.216-73 Alt II)</title>
        <subtitle/>
        <label>Offerors marketing through dealers are requested to indicate below whether those dealers will be participating in the proposed contract.</label>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" type="radio">
            <option value="Yes">Yes</option>
            <option value="No">No</option>
        </data>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element></clause><clause clause_number="552.232-82_Original_0_05_01_2003" template_name="basic">
    
<element isdivided="1" layout="label_top" name="Payment/RemittanceAddress" sequence="1">
        <header/>
        <title>Contractor's Remittance (Payment) Address (552.232-82)</title>
        <subtitle/>
        <label>Provide address below:</label>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" maxlength="250" type="text_area"/>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element></clause><clause clause_number="52.219-28_Original_0_04_01_2009" template_name="basic">
    
    
    
    
<element isdivided="0" layout="label_top" name="SmallBusinessProgramRepresentation" sequence="30">
        <header/>
        <title>Post Award SBPRep (52.219-28)</title>
        <subtitle/>
        <label>Contractor is a small business concern?</label>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" type="radio">
            <option value="Yes">Yes</option>
            <option value="No">No</option>
        </data>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element><element isdivided="0" layout="label_top" name="ContractNumber" sequence="31">
        <header/>
        <title>under Contract number</title>
        <subtitle/>
        <label>under Contract number</label>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" maxlength="15" type="text_field"/>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element><element isdivided="0" layout="label_top" name="naicsCode" sequence="32">
        <header/>
        <title>under NAICS code</title>
        <subtitle/>
        <label>under NAICS code</label>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" maxlength="15" type="text_field"/>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element><element isdivided="1" layout="label_top" name="AuthorizedSigner" sequence="33">
        <header/>
        <title>authorised signer</title>
        <subtitle/>
        <label>authorized signer's name and title (multiple if needed)</label>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="0" maxlength="15" type="text_field"/>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation/>
    </element></clause><clause clause_number="K-FSS-9_Original_0_01_22_2009" template_name="basic">
    
<element isdivided="1" layout="label_top" name="RepresentationForMultipleAwardScheduleProgram" sequence="50">
        <header/>
        <title>Representation for the Multiple Award Schedule Program</title>
        <subtitle/>
        <label>The Offeror represents that it is a current 8(a) Business Development Program participant, and that it wishes to be designated as such on the FSS Schedules E-Library and GSA Advantage!TM as well as the Federal Procurement Data System (FPDS).</label>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" type="radio">
            <option value="Yes">Yes</option>
            <option value="No">No</option>
        </data>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element></clause><clause clause_number="52.212-3_Original_0_03_16_2011" template_name=""/><clause clause_number="SCP-FSS-001_Original_0_03_25_2014" regulationCategory="P" template_name="provisions">
    
    
    
    
    
<element group="Technical Proposal" isdivided="0" layout="label_top" name="CorporateExperience" sequence="101">
        <header/>
        <title>Corporate Experience</title>
        <subtitle/>
        <label/>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" maxlength="15" type="text_field"/>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element><element group="Technical Proposal" isdivided="0" layout="label_top" name="PastPerformance" sequence="102">
        <header/>
        <title>Past Performance</title>
        <subtitle/>
        <label/>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" maxlength="15" type="text_field"/>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element><element group="Technical Proposal" isdivided="0" layout="label_top" name="QualityControl" sequence="103">
        <header/>
        <title>Quality Control</title>
        <subtitle/>
        <label/>
        <prefixlabel/>
        <defaultvalue/>
        <data isrequired="1" maxlength="15" type="text_field"/>
        <datavalues>
            <datavalue/>
        </datavalues>
        <fieldvalidation>
            <validation>
                <validationname>Required</validationname>
                <validationvalue/>
            </validation>
        </fieldvalidation>
    </element><documents>
        <document id="145" isrequired="1">
            <type>PastPerformance&amp;Experience</type>
            <typedescription>Past Performance &amp; Experience</typedescription>
        </document>
        <document id="146" isrequired="1">
            <type>OrderFormforPastPerformanceEval</type>
            <typedescription>Order Form for Past Performance Eval</typedescription>
        </document>
    </documents><validations/></clause></clauses><documents/><sins><sin sin_group="" sin_number="1011 1"><title>1011 1- </title><description> </description><setaside>N</setaside><stateLocal>N</stateLocal><NAICS isrequired="1" label="NAICS is the North American Industry Classification System for classifying establishments by type of economic activity, emphasizing what your company does." name="NaicsCode" prefixlabel="What is the NAICS code for this SIN?" title="NAICS Code" validationname="Required"><NAICS_code><code>111411</code><name/><description/></NAICS_code></NAICS></sin><sin sin_group="" sin_number="1011 2"><title>1011 2- </title><description> </description><setaside>N</setaside><stateLocal>N</stateLocal><NAICS isrequired="1" label="NAICS is the North American Industry Classification System for classifying establishments by type of economic activity, emphasizing what your company does." name="NaicsCode" prefixlabel="What is the NAICS code for this SIN?" title="NAICS Code" validationname="Required"><NAICS_code><code>111411</code><name/><description/></NAICS_code></NAICS></sin><sin sin_group="" sin_number="1011 3"><title>1011 3- </title><description> </description><setaside>N</setaside><stateLocal>N</stateLocal><NAICS isrequired="1" label="NAICS is the North American Industry Classification System for classifying establishments by type of economic activity, emphasizing what your company does." name="NaicsCode" prefixlabel="What is the NAICS code for this SIN?" title="NAICS Code" validationname="Required"><NAICS_code><code>111411</code><name/><description/></NAICS_code></NAICS></sin><sin sin_group="" sin_number="1011 4"><title>1011 4- </title><description> </description><setaside>N</setaside><stateLocal>N</stateLocal><NAICS isrequired="1" label="NAICS is the North American Industry Classification System for classifying establishments by type of economic activity, emphasizing what your company does." name="NaicsCode" prefixlabel="What is the NAICS code for this SIN?" title="NAICS Code" validationname="Required"><NAICS_code><code>111411</code><name/><description/></NAICS_code></NAICS></sin></sins><FormattedVendorResponses><clause><number>52.204-3-ACCD2</number><title>Tax Payer Identification</title><type>Original</type><type_num>0</type_num></clause><clause><number>52.XAllRule-33</number><title>TEST Automation Original</title><type>Original</type><type_num>0</type_num></clause><clause><number>52.X34</number><title>test automation</title><type>Original</type><type_num>0</type_num></clause><clause><number>52.203-2-TEST</number><title>TEST ADDRESS REGULATION</title><type>Original</type><type_num>0</type_num></clause></FormattedVendorResponses></solicitation>]]>
    </swsSolXml>
         <consumer>0</consumer>
      </urn:publishSolicitation>
   </soapenv:Body>
</soapenv:Envelope>